# Tips and Trick Pandas Python 02 !

# Pemilihan baris (row selection) pada Data Frame

# Import Module

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__) #print versi pandas
print(np.__version__) #print versi numpy

1.2.4
1.20.1

# Buat Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple ('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), columns=cols)

df

   A  B  C  D  E
0  1  2  3  3  3
1  2  2  1  3  4
2  2  4  3  1  3
3  3  2  3  2  1
4  3  4  3  1  3
5  2  1  3  1  3
6  2  2  4  4  3
7  2  2  1  4  4
8  2  1  2  1  4
9  2  3  1  2  3

# Selection dengan Operator Logika `or atau '|'`

In [4]:
df[(df['A']==1)|(df['A']==3)]

   A  B  C  D  E
0  1  2  3  3  3
3  3  2  3  2  1
4  3  4  3  1  3

# Sederhanakan logika or dengan `isin()`

Kolom A dengan nilai 1 atau 3

In [5]:
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  1  2  3  3  3
3  3  2  3  2  1
4  3  4  3  1  3

# Operator Negasi dengan `~`

Kolom A TIDAK SAMA DENGAN nilai 1 atau 3

In [6]:
df[~df['A'].isin([1,3])]

   A  B  C  D  E
1  2  2  1  3  4
2  2  4  3  1  3
5  2  1  3  1  3
6  2  2  4  4  3
7  2  2  1  4  4
8  2  1  2  1  4
9  2  3  1  2  3